import {T_Climber} from "src/modules/types.ts";

export const ClimberMocks:T_Climber[] = [
    {
        id: 1,
        name: "Эдмунд Хилари",
        status: 1,
        image: "",
        description: "В 11:30 утра 29 мая 1953 г. Эдмунд Хиллари из Новой Зеландии и Тенцинг Норгей, шерпа из Непала, стали первыми известными исследователями, достигшими вершины горы Эверест, которая на высоте 29 035 футов над уровнем моря является самой высокой точкой на земле. Эти двое в составе британской экспедиции совершили свой последний штурм вершины, проведя беспокойную ночь на высоте 27 900 футов. Новость об их достижении облетела весь мир 2 июня, в день коронации королевы Елизаветы II, и британцы приветствовали это как хорошее предзнаменование для будущего их страны.",
        peak: "Эверест"
    },
    {
        id: 2,
        name: "Маттиас Цурбригген",
        status: 1,
        image: "",
        description: "В 1892 году английский барон и альпинист Мартин Конвей нанял Маттиаса для участия в своей экспедиции по Каракоруму. В рамках этой экспедиции, которая заняла 8 месяцев, они совершили первое восхождение на Пионер-Пик (6890 метров; второстепенный пик вершины Балторо-Кангри) с ледника Балторо, что являлось высочайшей покорённой вершиной в мире на тот момент.",
        peak: "Аконкагуа"
    },
    {
        id: 3,
        name: "Хадсон Стак",
        status: 1,
        image: "",
        description: "Первое подтвержденное восхождение — американская экспедиция под командой преподобного Хадсона Стака. Самый простой и популярный маршрут на Денали — по Западному контрфорсу. Кроме технической сложности (маршрут относительно простой), при восхождении на Денали существенным фактором является погода — при ее ухудшении температура может опускаться до -40°С при штормовом ветре.",
        peak: "Денали"
    },
    {
        id: 4,
        name: "Ганс Мейер",
        status: 1,
        image: "",
        description: "Первое восхождение совершено в 1889 году немецким путешественником Гансом Мейером и австрийским альпинистом Людвигом Пуртшеллером. На вершину Ухуру ведут 6 простых маршрута — Марангу, Умбве, Шира, Немошо, Ронгаи и Машаме, не требующий альпинистской подготовки. Самый популярный, благодаря инфраструктуре — хижинам и пр. — Марангу, по нему заходит основная масса восходителей. Вершину Килиманджаро покрывает снежно-ледовая шапка, однако в последние годы она стремительно тает.",
        peak: "Килиманджаро"
    }
]